# TODO: работа с гитом

# .gitignore - файл в котором описывается то, что мы не должны заливать на гит хаб

# инициализация гита в проекте
# git init - инициализирует пустой гит репозиторий в папке проекта

# git status - проверяет добавляемые папки\файлы в репозиторий
# git add <название_файл>\. - добавляет все измененные или новые файлы и папки для просмотра
# git commit -m "комментарий"
# git branch -M main - создали главную ветку (ДЕЛАЕТСЯ ТОЛЬКО 1 РАЗ В НАЧАЛЕ)
# git push -u origin main
# настройка профиля отправляющего изменения в репозиторий

# git config user.name '' - указываем  юзернейм аккаунта который отправляет данные
# git config user.email '' - указываем почту аккаунта который отправляет данные

